# Código de inicialización
Este código permite inicializar las bibliotecas para usar SQLite en la máquina virtual de Google Colab. El código además elimina cualquier dato almacenado anteriormente en el archvio `ejemplos.db`. Es recomendable volver a correr el código cada vez que se comience con la resolución de un nuevo ejercicio.

In [1]:
!pip install pymysql
%load_ext sql
!rm -rf ejemplos.db
%sql sqlite:///ejemplos.db

Requirement already satisfied: pymysql in /usr/local/lib/python3.10/dist-packages (1.1.1)

# TP2: Ejercicios de SQL


## EJERCICIO 1:  Base de datos para un club náutico

### Descripción:
Se quiere diseñar una base de datos relacional para gestionar los datos de los socios de un club náutico. De cada socio se guardan los datos personales y la información de los barcos que posee:
- Número de matrícula, nombre, número de amarre, cuota.

Además, se almacena información sobre las salidas realizadas por cada barco:
- Fecha y hora de salida, destino y datos del patrón (que no tiene que ser el propietario ni un socio del club).

### Esquema propuesto:
- Tabla `Socios`: Almacena la información de los socios del club.
- Tabla `Barcos`: Almacena la información de los barcos y sus propietarios.
- Tabla `Salidas`: Almacena la información de las salidas realizadas por los barcos.

### Esquema de tablas
Este sería el esquema de tablas en lenguaje DBML

```dbml
Table Socios {
    id_socio INT [pk]
    nombre VARCHAR(100)
    direccion VARCHAR(255)
}

Table Barcos {
    matricula VARCHAR(20) [pk]
    nombre VARCHAR(100)
    numero_amarre INT
    cuota DECIMAL(10, 2)
    id_socio INT [ref: > Socios.id_socio]
}

Table Salidas {
    id_salida INT [pk]
    matricula VARCHAR(20) [ref: > Barcos.matricula]
    fecha_salida DATE
    hora_salida TIME
    destino VARCHAR(100)
    patron_nombre VARCHAR(100)
    patron_direccion VARCHAR(255)
}
```

### Escriba abajo el código SQL necesario para crear las tablas:

In [11]:
%%sql
create table socios(id_socio int primary key, nombre varchar(100), direccion varchar(255));
create table barcos( matricula varchar(20) PRIMARY KEY, nombre varchar(100), numero_amarre INT, cuota decimal(10,2), id_socio int,constraint fk_id_socio foreign key(id_socio) references socios(id_socio));
create table salida(id_salida INT primary KEY, matricula varchar(20), fecha_salida DATE, hora_salida time, destino varchar(100), patron_nombre varchar(100), patron_direccion varchar(255), constraint fk_matricula foreign key(matricula) references barcos(matricula));

 * sqlite:///ejemplos.db
(sqlite3.OperationalError) table socios already exists
[SQL: create table socios(id_socio int primary key, nombre varchar(100), direccion varchar(255));]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

El código SQL de abajo le permite popular (es decir, rellenar) las tablas con datos.

In [3]:
%%sql
-- Populación de las tablas
INSERT INTO Socios (id_socio, nombre, direccion)
VALUES
(1, 'Juan Pérez', 'Calle Mayor 1, Madrid'),
(2, 'Ana García', 'Calle Luna 5, Barcelona'),
(3, 'Luis Fernández', 'Avenida del Sol 10, Valencia'),
(4, 'Laura Sánchez', 'Plaza del Mar 3, Alicante'),
(5, 'Carlos López', 'Calle Río 8, Sevilla'),
(6, 'Marta Díaz', 'Calle de la Sierra 12, Zaragoza'),
(7, 'Pedro Gómez', 'Calle Nueva 20, Bilbao'),
(8, 'Lucía Jiménez', 'Calle Real 30, Madrid'),
(9, 'María Torres', 'Calle Verde 15, Málaga'),
(10, 'Fernando Martín', 'Calle Azul 25, Murcia');

INSERT INTO Barcos (matricula, nombre, numero_amarre, cuota, id_socio)
VALUES
('ABC123', 'El Viento', 12, 600.50, 1),
('DEF456', 'La Brisa', 8, 450.00, 2),
('GHI789', 'El Sol', 15, 700.00, 3),
('JKL012', 'El Mar', 10, 550.75, 4),
('MNO345', 'La Luna', 18, 620.30, 5),
('PQR678', 'El Horizonte', 20, 780.90, 6),
('STU901', 'El Amanecer', 5, 400.00, 7),
('VWX234', 'La Estrella', 7, 520.50, 8),
('YZA567', 'La Marea', 14, 480.75, 9),
('BCD890', 'El Océano', 6, 630.80, 10);

INSERT INTO Salida (id_salida, matricula, fecha_salida, hora_salida, destino, patron_nombre, patron_direccion)
VALUES
(1, 'ABC123', '2023-07-15', '10:30:00', 'Mallorca', 'Patrón 1', 'Calle de la Playa 1, Palma'),
(2, 'DEF456', '2023-07-20', '09:00:00', 'Ibiza', 'Patrón 2', 'Avenida del Puerto 3, Valencia'),
(3, 'GHI789', '2023-07-22', '08:45:00', 'Menorca', 'Patrón 3', 'Calle de la Costa 10, Alicante'),
(4, 'JKL012', '2023-07-25', '11:15:00', 'Mallorca', 'Patrón 4', 'Plaza del Faro 5, Barcelona'),
(5, 'MNO345', '2023-08-01', '14:00:00', 'Formentera', 'Patrón 5', 'Calle del Puerto 20, Ibiza'),
(6, 'PQR678', '2023-08-05', '07:30:00', 'Mallorca', 'Patrón 6', 'Calle de las Olas 15, Palma'),
(7, 'STU901', '2023-08-10', '12:00:00', 'Ibiza', 'Patrón 7', 'Avenida de la Marina 7, Barcelona'),
(8, 'VWX234', '2023-08-12', '09:30:00', 'Cabrera', 'Patrón 8', 'Calle del Mar 12, Alicante'),
(9, 'YZA567', '2023-08-15', '10:00:00', 'Formentera', 'Patrón 9', 'Calle del Sol 4, Ibiza'),
(10, 'BCD890', '2023-08-20', '08:00:00', 'Menorca', 'Patrón 10', 'Plaza del Faro 2, Palma');

 * sqlite:///ejemplos.db
10 rows affected.
10 rows affected.
10 rows affected.

[]

### Resolver estas consignas sin usar JOIN:
Estas consirgnas deben resolverse usando lo visto en la clase del lunes 16/09 antes de ver la parte de JOIN. Esto es: subconsultas, etc.
1. ¿Qué socios tienen barcos amarrados en un número de amarre mayor que 10?

In [4]:
%%sql
select id_socio from barcos where numero_amarre >= 10;

 * sqlite:///ejemplos.db
Done.

[(1,), (3,), (4,), (5,), (6,), (9,)]

2. ¿Cuáles son los nombres de los barcos y sus cuotas de aquellos barcos cuyo socio se llama 'Juan Pérez'?

In [5]:
%%sql
select matricula from barcos where id_socio = (select id_socio from socios where nombre = 'Juan Pérez');

 * sqlite:///ejemplos.db
Done.

[('ABC123',)]

3. ¿Cuántas salidas ha realizado el barco con matrícula 'ABC123'?

In [6]:
%%sql
select matricula,count(*) from salida where matricula = 'ABC123' group by matricula;

 * sqlite:///ejemplos.db
Done.

[('ABC123', 1)]

4. Lista los barcos que tienen una cuota mayor a 500 y sus respectivos socios.

In [7]:
%%sql
select nombre,(select matricula from barcos where id_socio = socios.id_socio) as matricula
from socios where id_socio = (select id_socio from barcos where id_socio = socios.id_socio and cuota > 500);

 * sqlite:///ejemplos.db
Done.

[('Juan Pérez', 'ABC123'),
 ('Luis Fernández', 'GHI789'),
 ('Laura Sánchez', 'JKL012'),
 ('Carlos López', 'MNO345'),
 ('Marta Díaz', 'PQR678'),
 ('Lucía Jiménez', 'VWX234'),
 ('Fernando Martín', 'BCD890')]

5. ¿Qué barcos han salido con destino a 'Mallorca'?

In [8]:
%%sql
select matricula,(select destino from salida where matricula = barcos.matricula) as destino
from barcos where matricula = (select matricula from salida where matricula = barcos.matricula and destino = 'Mallorca');

 * sqlite:///ejemplos.db
Done.

[('ABC123', 'Mallorca'), ('JKL012', 'Mallorca'), ('PQR678', 'Mallorca')]

6. ¿Qué patrones (nombre y dirección) han llevado un barco cuyo socio vive en 'Barcelona'?

In [12]:
%%sql
select patron_nombre,patron_direccion
from salida where matricula in(select matricula from barcos where id_socio =
(select id_socio from socios where direccion like '%Barcelona%'));

 * sqlite:///ejemplos.db
Done.

[('Patrón 2', 'Avenida del Puerto 3, Valencia')]

### Resolver nuevamentos los incisos, pero ahora usa JOIN
1. ¿Qué socios tienen barcos amarrados en un número de amarre mayor que 10?

In [13]:
%%sql
select * from socios as s
	inner join barcos as sb
		on s.id_socio = sb.id_socio and sb.numero_amarre > 10;

 * sqlite:///ejemplos.db
Done.

[(1, 'Juan Pérez', 'Calle Mayor 1, Madrid', 'ABC123', 'El Viento', 12, 600.5, 1),
 (3, 'Luis Fernández', 'Avenida del Sol 10, Valencia', 'GHI789', 'El Sol', 15, 700, 3),
 (5, 'Carlos López', 'Calle Río 8, Sevilla', 'MNO345', 'La Luna', 18, 620.3, 5),
 (6, 'Marta Díaz', 'Calle de la Sierra 12, Zaragoza', 'PQR678', 'El Horizonte', 20, 780.9, 6),
 (9, 'María Torres', 'Calle Verde 15, Málaga', 'YZA567', 'La Marea', 14, 480.75, 9)]

2. ¿Cuáles son los nombres de los barcos y sus cuotas de aquellos barcos cuyo socio se llama 'Juan Pérez'?

In [16]:
%%sql
select sb.nombre, sb.cuota from barcos as sb
	inner join socios as s
		on s.id_socio = sb.id_socio and s.nombre = 'Juan Pérez';

 * sqlite:///ejemplos.db
Done.

[('El Viento', 600.5)]

3. ¿Cuántas salidas ha realizado el barco con matrícula 'ABC123'?

In [22]:
%%sql
select sb.nombre, sb.matricula, s.id_salida, count(*) as num_salida from barcos as sb
	inner join salida as s
		on s.matricula = sb.matricula and s.matricula = 'ABC123' group by sb.matricula;

 * sqlite:///ejemplos.db
Done.

[('El Viento', 'ABC123', 1, 1)]

4. Lista los barcos que tienen una cuota mayor a 500 y sus respectivos socios.

In [24]:
%%sql
select b.matricula,b.nombre,s.nombre,s.id_socio from barcos as b inner join socios as s
where s.id_socio = b.id_socio and b.cuota >= 500;

 * sqlite:///ejemplos.db
Done.

[('ABC123', 'El Viento', 'Juan Pérez', 1),
 ('GHI789', 'El Sol', 'Luis Fernández', 3),
 ('JKL012', 'El Mar', 'Laura Sánchez', 4),
 ('MNO345', 'La Luna', 'Carlos López', 5),
 ('PQR678', 'El Horizonte', 'Marta Díaz', 6),
 ('VWX234', 'La Estrella', 'Lucía Jiménez', 8),
 ('BCD890', 'El Océano', 'Fernando Martín', 10)]

5. ¿Qué barcos han salido con destino a 'Mallorca'?

In [25]:
%%sql
select b.matricula,b.nombre from barcos as b inner join salida as s
where s.matricula = b.matricula and s.destino = 'Mallorca';

 * sqlite:///ejemplos.db
Done.

[('ABC123', 'El Viento'), ('JKL012', 'El Mar'), ('PQR678', 'El Horizonte')]

6. ¿Qué patrones (nombre y dirección) han llevado un barco cuyo socio vive en 'Barcelona'?

In [27]:
%%sql
select patron_nombre,patron_direccion from salida inner join barcos on
 salida.matricula = barcos.matricula inner join socios on
barcos.id_socio = socios.id_socio where
 socios.direccion like '%Barcelona%';

 * sqlite:///ejemplos.db
Done.

[('Patrón 2', 'Avenida del Puerto 3, Valencia')]


## EJERCICIO 2: Base de datos para un gabinete de abogados

### Descripción:
Se quiere diseñar una base de datos relacional para almacenar información sobre los asuntos que lleva un gabinete de abogados. Cada asunto tiene un número de expediente que lo identifica y corresponde a un solo cliente. Del asunto se debe almacenar:
- Período (fecha de inicio y fecha de archivo o finalización)
- Estado (en trámite, archivado, etc.)
- Datos personales del cliente (DNI, nombre, dirección, etc.)

Algunos asuntos son llevados por uno o varios procuradores, de los que nos interesa también almacenar los datos personales.

### Esquema propuesto:
- Tabla `Clientes`: Almacena la información de los clientes: dni (clave primaria), nombre y dirección.
- Tabla `Asuntos`: Almacena la información de los asuntos: numero de expediente (clave primaria), dni del cliente (clave externa), fecha de inicio, fecha de fin y estado (Abierto o Cerrado). Si el asunto está abierto, no tiene fecha de fin.
- Tabla `Procuradores`: Almacena la información de los procuradores: id del procurador (clave priaria), nombre y dirección.
- Tabla `Asuntos_Procuradores`: Relaciona los asuntos con los procuradores (muchos a muchos).

### SQL para crear las tablas:

In [2]:
%%sql
create table clientes(dni int primary key, nombre varchar(50), direccion varchar(50));
create table asuntos(num_expediente int primary key, dni_cliente int,
fecha_inicio date,fecha_fin date, abierto boolean,
constraint fk_dni foreign key(dni_cliente) references clientes(dni));
create table procuradores(id_procurador int primary key, nombre varchar(50), direccion varchar(50));
create table asuntos_procuradores(numero_expediente int, id_procurador int,
constraint fk_asunto foreign key(numero_expediente) references asuntos(num_expediente),
constraint fk_procurador foreign key(id_procurador) references procuradores(id_procurador)
);

 * sqlite:///ejemplos.db
Done.
Done.
Done.
Done.

[]

In [3]:
%%sql
-- Poblar la tabla Clientes
INSERT INTO Clientes (dni, nombre, direccion)
VALUES
('123456789', 'Juan Pérez', 'Calle Pueyrredón 3498, Buenos Aires'),
('987654321', 'Ana García', 'Calle 5 323, La Plata'),
('456123789', 'Luis Fernández', 'Avenida de Gral. Paz 1056, Bahía Blanca');

-- Poblar la tabla Asuntos
INSERT INTO Asuntos (num_expediente, dni_cliente, fecha_inicio, fecha_fin, abierto)
VALUES
(1, '123456789', '2023-01-15', '2023-07-20', 0),
(2, '987654321', '2023-05-10', NULL, 1),
(3, '456123789', '2023-06-01', '2023-09-10', 0);

-- Poblar la tabla Procuradores
INSERT INTO Procuradores (id_procurador, nombre, direccion)
VALUES
(1, 'Laura Sánchez', 'Calle Soler 3765, Buenos Aires'),
(2, 'Carlos López', 'Calle Estrellas 8, Mar del Plata'),
(3, 'Marta Díaz', 'Calle Estación 12, Olavarria');

-- Poblar la tabla Asuntos_Procuradores
INSERT INTO Asuntos_Procuradores (numero_expediente, id_procurador)
VALUES
(1, 1),
(2, 2),
(3, 3),
(2, 1);  -- Un asunto puede tener varios procuradores

 * sqlite:///ejemplos.db
3 rows affected.
3 rows affected.
3 rows affected.
4 rows affected.

[]

### Resolver estas consignas usando _únicamente_ JOIN en las consultas:
1. ¿Cuál es el nombre y la dirección de los procuradores que han trabajado en un asunto abierto?

In [5]:
%%sql
select nombre,direccion from procuradores p inner join asuntos_procuradores ap on p.id_procurador = ap.id_procurador
inner join asuntos a on ap.numero_expediente = a.num_expediente where a.abierto = 1;

 * sqlite:///ejemplos.db
Done.

[('Carlos López', 'Calle Estrellas 8, Mar del Plata'),
 ('Laura Sánchez', 'Calle Soler 3765, Buenos Aires')]

2. ¿Qué clientes han tenido asuntos en los que ha participado el procurador Carlos López?

In [7]:
%%sql
select c.nombre,c.direccion from clientes c inner join asuntos a on a.dni_cliente = c.dni
inner join asuntos_procuradores ap on ap.numero_expediente = a.num_expediente join procuradores p
on ap.id_procurador = p.id_procurador where p.nombre = 'Carlos López';

 * sqlite:///ejemplos.db
Done.

[('Ana García', 'Calle 5 323, La Plata')]

3. ¿Cuántos asuntos ha gestionado cada procurador?

In [9]:
%%sql
select p.nombre,count(*) as num_asuntos from procuradores p inner join asuntos_procuradores ap
on p.id_procurador = ap.id_procurador inner join asuntos a on ap.numero_expediente = a.num_expediente group by p.nombre;

 * sqlite:///ejemplos.db
Done.

[('Carlos López', 1), ('Laura Sánchez', 2), ('Marta Díaz', 1)]

4. Lista los números de expediente y fechas de inicio de los asuntos de los clientes que viven en Buenos Aires.

In [11]:
%%sql
select a.num_expediente,a.fecha_inicio from clientes c inner join asuntos a on c.dni = a.dni_cliente
inner join asuntos_procuradores ap on ap.numero_expediente = a.num_expediente
inner join procuradores p on ap.id_procurador = p.id_procurador where c.direccion like '%Buenos Aires%';

 * sqlite:///ejemplos.db
Done.

[(1, '2023-01-15')]

# Entrega
La entrega consiste en completar esta hoja y subirla a su repositorio GIT
Se deben entregar también los diagramas de esquema de tablas como imagenes aparte.
Fecha límite: 30 de septiembre a las 23:59 hs